#Задача №6
a = int(input())
fake = [
    11, 12, 13, 14, 111, 112, 113, 114, 211, 212, 213, 214, 311, 312, 313, 314,
    411, 412, 413, 414, 511, 512, 513, 514, 611, 612, 613, 614, 711, 712, 713,
    714, 811, 812, 813, 814, 911, 912, 913, 914
]
if a < 0 or a > 1000:
    print('Неверное значение')
if a in fake:
    print(a, 'программистов')
else:
    b = a % 10
    if b == 1:
        print(a, 'программист')
    elif 2 <= b <= 4:
        print(a, 'программиста')
    elif b == 0 or 5 <= b <= 9:
        print(a, 'программистов')